apps/paths/load-tests/http-load.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/"
        - get:
            url: "/actions"
        count: 5